tynia/STM32F10x/STM32F10x/user/gpio/gpio.c
#include "gpio.h"
#include "util/util.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_gpio.h"

typedef struct _tag_gpio_group
{
    u32 gpio_periph;
    GPIO_InitTypeDef* gpiox;
} tag_gpio_group;

static tag_gpio_group GPIOGroup[GPIO_COUNT] = {
    { RCC_APB2Periph_GPIOA, GPIOA },
    { RCC_APB2Periph_GPIOB, GPIOB },
    { RCC_APB2Periph_GPIOC, GPIOC },
    { RCC_APB2Periph_GPIOD, GPIOD },
    { RCC_APB2Periph_GPIOE, GPIOE },
    { RCC_APB2Periph_GPIOF, GPIOF },
    { RCC_APB2Periph_GPIOG, GPIOG }
};

void gpio_init(u8 idx, u16 pinx, u8 mode, u8 speed)
{
    ASSERT((idx >= 0 && idx < GPIO_COUNT), "invalid GPIO idx");
    RCC_APB2PeriphClockCmd(GPIOGroup[idx].gpio_periph, ENABLE);
    GPIO_InitTypeDef gpio_init_struct;
    gpio_init_struct.GPIO_Pin = pinx;
    gpio_init_struct.GPIO_Mode = mode;
    gpio_init_struct.GPIO_Speed = speed;
    GPIO_Init(GPIOGroup[idx].gpiox, &gpio_init_struct);
}

void gpio_set_bits(u8 idx, u16 pin, u8 on)
{
    ASSERT((idx >= 0 && idx < GPIO_COUNT), "invalid GPIO idx");

    if (0 != on)
    {
        GPIO_SetBits(GPIOGroup[idx].gpiox, pin);
    }
    else
    {
        GPIO_ResetBits(GPIOGroup[idx].gpiox, pin);
    }
}